# FilterNumericValueRule Properties

---
The FilterNumericValueRule type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule)
Top
#### Reference
FilterNumericValueRule Class
Autodesk.Revit.DB Namespace